{"posts":[{"title":"Giới thiệu sách “Arduino cho người mới bắt đầu”","text":"Giới thiệuArduino đã quá quen thuộc với các bạn học sinh, sinh viên vì dễ tiếp cận, nguồn tài liệu dồi dào (bằng tiếng Việt), và thời gian thực hiện ngắn,… Dựa trên nhu cầu đó, minht57lab đã giới thiệu đến các bạn đọc 3 quyển e-book miễn phí vào 15/09/2020. Bộ sách sẽ đi từ những kiến thức cơ bản nhất đến những kiến thức chuyên sâu. Định hướng của bộ sách dành cho các bạn học lập trình vi điều khiển chuyên sâu và Arduino là một sự khởi đầu. Bộ sách này bạn có thể đọc và thực hành không cần đến board mạch Arduino thực tế, tất cả các ví dụ đều được mô phỏng online. Các quyển sáchBộ sách gồm 3 quyển bao gồm: quyển cơ bản, quyển rất cơ bản và quyển không còn là cơ bản. Đường dẫn các quyển sách: ARDUINO CHO NGƯỜI MỚI BẮT ĐẦU _ Quyển cơ bản ARDUINO CHO NGƯỜI MỚI BẮT ĐẦU _ Quyển rất cơ bản ARDUINO CHO NGƯỜI MỚI BẮT ĐẦU _ Quyển không còn là cơ bản Quyển cơ bản Những linh kiện điện tử cơ bản Kiến thức C cơ bản Những module ngoại vi mà một vi điều khiển cần phải có (GPIO, Time, UART, SPI, I2C, Interrupt). Ngoài ra, sách còn bổ sung cho bạn một số kiến thức quan trọng và một số mạch điện ví dụ (cuối sách) để hiểu rõ hơn những bài học. Quyển rất cơ bảnThảo luận những vấn đề chuyên sâu hơn về lập trình C cho vi điều khiển cũng như chi tiết code bên trong của Arduino. Lập trình C là những điều cần biết: sẽ cung cấp cho bạn những kiến thức mà bạn cần biết khi lập trình vi điều khiển như biến volatile/register/…, cách một chương trình C build như thế nào, vùng hoạt động và giới hạn của biến, các loại vùng nhớ trong chương trình C, các loại biến pre-compile/link/post-build. Các module ngoại vi: sẽ cho bạn đọc một cái nhìn chi tiết về vi điều khiển hoạt động như thế nào và cách thiết kế chương trình của nền tảng Arduino. Quyển không còn là cơ bản Phong cách lập trình (coding style) Máy trạng thái cho vi điều khiển Bộ điều khiển PID Bộ lọc Kalman Một số đường dẫn để học về GIT Một tư tưởng về phát triển sản phẩm cho các bạn tự học giai đoạn đầu. Một số chia sẻ của minht57lab về cách đọc các quyển sách Nếu bạn đọc cần hướng dẫn arduino làm việc với các loại cảm biến, hoặc một dự án cụ thể thì đây không phải bộ sách dành cho bạn. Mình tin đã có nhiều quyển sách (miễn phí hoặc có phí) đã làm rất tốt những hướng dẫn này để bạn có thể nhanh chóng làm những ứng dụng với nhiều tính năng sáng tạo. Nếu bạn không lập trình Arduino thì bộ sách này vẫn dành cho bạn nếu bạn muốn có những kiến thức cơ bản về lập trình vi điều khiển nói chung. minht57lab đề xuất những đề mục cần đọc nếu bạn không lập trình Arduino ở cuối bài viết này. Bạn đọc nếu là người mới bắt đầu và chưa có thực hành nhiều với Arduino thì được khuyến khích không nên đọc quyển 2 (quyển rất cơ bản) ngay sau quyển 1 (quyển cơ bản), mà hãy dành thời gian để làm các dự án mẫu ở trên những nguồn tài liệu khác để bạn đọc có những trải nghiệm và kinh nghiệm nhất định về Arduino. Quyển 3 bạn có thể xem qua trước vì chủ yếu là những từ khóa hơn là những bài hướng dẫn cụ thể. Hướng dẫn đọc sách cho người không lập trình bằng ArduinoQuyển cơ bản: Linh kiện điện tử cơ bản Lập trình C cơ bản Phụ lục C: Một số khái niệm cơ bản Quyển rất cơ bản: Lập trình C Các module ngoại vi: 3.1 GPIO 5 UART 6.1 - 6.2 Analog 7.1 - 7.2 I2C 8.1 - 8.2 SPI 9.1 Interrupt Phụ lục A Quyển không còn là cơ bản Đọc hết Lời kếtminht57lab rất mong nhận được những đóng góp ý kiến của các bạn để minht57lab có xây dựng bộ sách chất lượng nhất được gửi đến các bạn đọc ở nhiều thế hệ phía sau.","link":"/books/Introduction-of-Arduino-e-books/"},{"title":"Giới thiệu sách ROS 2","text":"Giới thiệuRobot Operating System (ROS) ngày càng dần phổ biến trong cộng đồng robotics. ROS phiên bản đầu tiên (ROS 1) đã phát triển không ngừng nhưng cuối cùng cũng đã ngừng hỗ trợ để nhường lại sự phát triển cho ROS 2, một nền tảng đầy hứa hẹn. ROS 2 sẽ khắc phục được nhiều nhược điểm mà ROS 1 chưa thực hiện được, đồng thời cũng mở rộng khả năng của mình để có thể đi ở nhiều lĩnh vực, nhiều khía cạnh từ nghiên cứu đến công nghiệp. Các quyển sáchBộ sách gồm sẽ gồm nhiều quyển được viết và dịch bởi minht57lab. Đầu năm 2023, minht57lab giới thiệu cho bạn đọc hai quyển đầu tiên được dịch từ trang web của ROS 2. Đường dẫn các quyển sách: ROS 2 | Hướng dẫn cơ bản | Được dịch bởi minht57lab ROS 2 | Các khái niệm | Được dịch bởi minht57lab Hướng dẫn cơ bản Được dịch từ loạt các bài tại Tutorials. Quyển này sẽ dịch phần lớn các bài từ trình độ bắt đầu (beginner), trung cấp (intermediate), nâng cao (advanced). Các khái niệm Được dịch từ loạt các bài tại Concepts. Quyển này sẽ dịch các khái niệm thường gặp trong ROS. Một số chia sẻ của minht57lab về cách đọc các quyển sách Sách được viết bằng tiếng Việt nhưng một số từ khóa thì minht57lab giữ nguyên từ tiếng anh để đảm bảo bạn đọc hiểu trọn nghĩa và dễ dàng nghiên cứu khi bạn đọc tìm kiếm và làm việc bằng tiếng anh. Nếu bạn đọc cảm thấy không phù hợp với văn phong này thì có thể bỏ qua bộ sách này. Nếu bạn đọc có khả năng đọc hiểu tiếng anh khá tốt thì được khuyến khích là đọc tài liệu gốc để có thể hiện trọn vẹn ý nghĩa. Tài liệu dịch sẽ có thể không dịch sát nghĩa so với phiên bản tiếng anh (và do giới hạn về khả năng ngôn ngữ của người dịch) nên bạn đọc được khuyến khích nên tham khảo tài liệu gốc và nhiều nguồn thông tin khác nhau để có thể xác nhận kiến thức cá nhân mình hiểu là đúng. Bạn đọc được khuyến khích KHÔNG trích dẫn tài liệu này vào các tài liệu chính thống (vì có thể tài liệu chưa được xác nhận tính đúng đắn và cập nhật mới nhật). Mong nhận phản hồiminht57lab rất mong nhận được những đóng góp ý kiến của các bạn để minht57lab có xây dựng bộ sách chất lượng nhất được gửi đến các bạn đọc ở nhiều thế hệ phía sau. Lưu ý, tất cả các tài liệu được đăng tải bởi minht57lab đều miễn phí và chỉ sử dụng cho các mục đích cộng đồng không lợi nhuận. Vui lòng các bạn đọc giả hãy tôn trọng. Chúng tôi xin chân thành cảm ơn. Nếu bạn đọc có nhu cầu đọc bản dịch về ROS 2 Design, vui lòng gửi email cho chúng tôi và bày tỏ nhu cầu sử dụng tài liệu.","link":"/books/Introduction-of-ROS2-e-books/"}],"tags":[{"name":"Arduino","slug":"Arduino","link":"/tags/Arduino/"},{"name":"ROS2","slug":"ROS2","link":"/tags/ROS2/"}],"categories":[{"name":"books","slug":"books","link":"/books/"}],"pages":[{"title":"","text":"Giới thiệuminht57lab lần đầu tiên được giới thiệu với mọi người vào ngày 15/09/2020 nhằm giới thiệu đến các bạn đọc bộ ebook miễn phí “Arduino cho người mới bắt đầu”.Với mục tiêu mang lại cho các bạn đọc giả có kiến thức sâu và rộng nhất trong khả năng của minht57lab bằng cách xuất bản các tài liệu miễn phí đến cho cộng đồng liên quan đến các chủ đề: Lập trình nhúng Robot Operating System (ROS) Mobile robots Multi-robot system Một số kiến thức, mẹo để tối ưu hóa công việc Một số bài chia sẻ kinh nghiệm Và rất nhiều chủ đề khác Bên cạnh đó, minht57lab còn được xây dựng với mục tiêu phát triển con người cho cộng đồng kỹ thuật nói chung và cho các thành viên thường trực nói riêng để hướng chúng ta đến sự phát triển toàn diện nói chung. Trích dẫnNếu bạn đọc muốn trích dẫn nội dung nào trong trang web này hoặc các repo trên Github, vui lòng đọc rõ giấy phép sử dụng mã nguồn (vì mỗi tài liệu, repo có thể thuộc các giấy phép khác nhau) và sử dụng URLs. Chúng tôi sẽ cố găng không thay đổi URLs của các bài viết. Liên lạcNếu bạn đọc có bất kỳ câu hỏi nào liên quan đến nội dung các bài đăng thì vui lòng đặt câu hỏi dưới mỗi bài đăng. Nếu bạn có câu hỏi nào liên quan đến bản quyền, vui lòng gửi Email đến chúng tôi. Chúng tôi sẽ cố gắng phản hồi đến bạn sớm nhất trong khả năng của chúng tôi. Góp ýTrong quá trình xây dựng minht57lab không thể nào tránh được những thiếu sót không thể biết trước, mong các bạn đọc giả có thể gửi góp ý đến chúng tôi thông qua các nền tảng giao tiếp như Facebook, Email. Tham giaNếu bạn đọc có mong muốn chia sẻ các bài viết của mình trên trang web của minht57lab, vui lòng liên hệ qua Facebook để được phản hồi nhanh nhất. Nếu bạn đọc có mong muốn trở thành một thành viên thường trực của minht57lab, bạn vui lòng liên hệ chúng tôi thông qua Facebook, Email để được hướng dẫn. Lưu ý, quá trình để bạn có thể trở thành thành viên thường trực sẽ không dễ dàng và để bạn có thể hoạt động xuyên suốt trong minht57lab sẽ càng khó khăn hơn gấp bội lần.","link":"/index.html"},{"title":"About","text":"Hiện tại minht57lab được xây dựng bởi các thành viên sau: Phan Minh Trí Anh ấy tốt nghiệp đại học chuyên ngành \"Điều khiển và tự động hóa\". Hướng phát triển mong muốn của anh ấy liên quan đến: Hệ thống nhúng Robotics: Mobile robot, mapping, navigation Trong minht57lab, anh ấy như người định hướng và phát triển chung cho cả con người và các hoạt động của minht57lab. Võ Ngọc Dương Anh ấy tốt nghiệp đại học chuyên ngành \"Điện tử viễn thông\". Hướng phát triển mong muốn của anh ấy liên quan đến: Thiết kế vi mạch Trong minht57lab, anh ấy chịu trách nhiệm liên quan đến các hoạt động thiết kế phần cứng, thiết kế mạch điện. Nguyễn Lê Tuấn Anh ấy tốt nghiệp đại học chuyên ngành \"Cơ điện tử\". Hướng phát triển mong muốn của anh ấy liên quan đến: Hệ thống nhúng Robotics: Mobile robot, industrial robot. Trong minht57lab, anh ấy chịu trách nhiệm liên quan đến các hoạt động thiết kế cơ khí, lập trình nhúng, lập trình giao diện, xây dựng tài liệu. Nếu bạn có nhu cầu liên hệ với bất kỳ cá nhân nào trong minht57lab, vui lòng liên hệ chúng tôi thông qua Facebook, Email.","link":"/about/index.bk.html"},{"title":"About","text":"Hiện tại minht57lab được xây dựng bởi các thành viên sau: Phan Minh Trí Anh ấy tốt nghiệp đại học chuyên ngành \"Điều khiển và tự động hóa\". Hướng phát triển mong muốn của anh ấy liên quan đến: Hệ thống nhúng Robotics: Mobile robot, mapping, navigation Trong minht57lab, anh ấy như người định hướng và phát triển chung cho cả con người và các hoạt động của minht57lab. Nếu bạn có nhu cầu liên hệ với bất kỳ cá nhân nào trong minht57lab, vui lòng liên hệ chúng tôi thông qua Facebook, Email.","link":"/about/index.html"}]}